Catalogs/Renault_КорпоративныеКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КорпоративныеКлиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияСогласованияКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СферыДеятельностиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтопаркСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЗаявки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаПодпискуНаКорпоративныйПорталRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛизинга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизинговаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЛизинговыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаРекламныхМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияНаКорпоративномПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СферыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СфераДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_СферыДеятельностиКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Автопарк</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Марка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КорпоративныеКлиенты_МаркиМодели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_КорпоративныеКлиенты/Ext/ManagerModule.bsl
Функция ПолучитьКоличествоКлиентов(СостояниеКлиента, сПараметров = Неопределено) Экспорт
	
	Наименование = "";
	Пользователь = "";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", СостояниеКлиента);
	Если  сПараметров <> Неопределено Тогда
		Если сПараметров.Свойство ("ПоказыватьУдаленныеЗаписи") Тогда
			Запрос.УстановитьПараметр("ПометкаУдаления", сПараметров.ПоказыватьУдаленныеЗаписи); 
		КонецЕсли;
		Если сПараметров.Свойство ("Наименование") Тогда
			Наименование = " и Renault_КорпоративныеКлиенты.Наименование Подобно &Наименование";
			Запрос.УстановитьПараметр("Наименование","%"+ сПараметров.Наименование + "%");
		КонецЕсли;
		Если сПараметров.Свойство ("Пользователь") И Не сПараметров.ЭтоРКП Тогда
			Пользователь = " и Renault_КорпоративныеКлиенты.Менеджер = &Менеджер";
			Запрос.УстановитьПараметр("Менеджер", сПараметров.Пользователь);
		КонецЕсли;
	КонецЕсли;
	//Козлов Е.А. Начало 15.07.2016
	//Текст = "ВЫБРАТЬ
	//	|	КОЛИЧЕСТВО(Renault_КорпоративныеКлиенты.Ссылка) КАК Количество
	//	|ИЗ
	//	|	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
	//	|ГДЕ
	//	|	Renault_КорпоративныеКлиенты.Состояние = &Состояние
	//	|	"+Наименование+" "+Пользователь+"
	//	|{ГДЕ
	//	|	Renault_КорпоративныеКлиенты.ПометкаУдаления}";
		
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(Renault_КорпоративныеКлиенты.Ссылка) КАК Количество
	        |ИЗ
	        |	Справочник.Renault_КорпоративныеКлиенты КАК Renault_КорпоративныеКлиенты
	        |ГДЕ
	        |	Renault_КорпоративныеКлиенты.Состояние = &Состояние
	        |	И Renault_КорпоративныеКлиенты.Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЮридическоеЛицо)
			|	"+Наименование+" "+Пользователь+"
			|{ГДЕ
	        |	Renault_КорпоративныеКлиенты.ПометкаУдаления}";
	//Козлов Е.А. Конец	
	Запрос.Текст = Текст;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции
